/*!
 *******************************************************************************
 * @file gui_ctrls_main.h
 *
 * @brief 
 *
 * @author Raúl Gotor (raulgotor@gmail.com)
 * @date 17.10.21
 *
 * @par
 * COPYRIGHT NOTICE: (c) 2021 Raúl Gotor
 * All rights reserved.
 *******************************************************************************
 */

#ifndef GUI_CTRLS_MAIN_H
#define GUI_CTRLS_MAIN_H

/*
 *******************************************************************************
 * Public Macros                                                               *
 *******************************************************************************
 */


/*
 *******************************************************************************
 * Public Data Types                                                           *
 *******************************************************************************
 */

/*
 *******************************************************************************
 * Public Constants                                                            *
 *******************************************************************************
 */


/*
 *******************************************************************************
 * Public Function Prototypes                                                  *
 *******************************************************************************
 */

void gui_ctrls_main_init(void);

void gui_ctrls_main_refresh(void);

void gui_ctrls_main_update_buttons(state_machine_state_text_t const state);

void gui_ctrls_main_button_event_cb(lv_obj_t * p_object, lv_event_t event);


#endif //GUI_CTRLS_MAIN_H